# Задача 3
# Вывести на экран числа от -N до N

print("Введите  первое число :")
a = int(input())
print("Введите  второе число :")
b = int(input())
while a < b +1:
    print(a)
    a = a+ 1
