# Задача 5
# Дано число. Проверить кратно ли оно 5 и 10 или 15 но не 30
print("Введите число :")
a = int(input())
if a % 30 == 0:
    print(f"Число {a} кратно 30!!!")
elif a % 5 == 0 and a % 10 == 0:
    print(f"Число {a} кратно 5 и 10  и не кратно 30")
elif a % 15 == 0:
    print(f"Число {a} кратно 15 и не кратно 30")