# Задача 12
# Для натурального n создать словарь индекс-значение,
# состоящий из элементов последовательности 3n + 1.
# Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
n = 10
# #n = int(input("Введите число n : "))
# d = {i: (i * 3 + 1) for i in range(1, n + 1)}
# print(d)

a = [i for i in range(1, n + 1)]

b = [i * 3 + 1 for i in range(1, n + 1)]
c = list(zip(a, b))
print(c)