# 14 Задача
#  Подсчитать сумму цифр в вещественном числе

from pickle import TRUE
from unicodedata import digit

n = input("Введите вещественное число :")
# count = 0
# for i in n:
#     if i.isdigit() == True:
#         count = count + 1

#print(f" количество цифр в числе = : {count}")

a = len(n)
print(f" количество цифр в числе = : {a}")
